; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 6032)
	(= (fuel plane1) 1904)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city1)
	(= (capacity plane2) 11148)
	(= (fuel plane2) 2004)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 19)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city3)
	(= (capacity plane3) 12291)
	(= (fuel plane3) 1974)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(at plane4 city4)
	(= (capacity plane4) 4339)
	(= (fuel plane4) 1838)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city4)
	(= (capacity plane5) 2163)
	(= (fuel plane5) 457)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 3)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 9)
	(at person1 city2)
	(at person2 city2)
	(at person3 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 920)
	(= (distance city0 city2) 697)
	(= (distance city0 city3) 891)
	(= (distance city0 city4) 899)
	(= (distance city1 city0) 920)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 955)
	(= (distance city1 city3) 598)
	(= (distance city1 city4) 667)
	(= (distance city2 city0) 697)
	(= (distance city2 city1) 955)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 884)
	(= (distance city2 city4) 638)
	(= (distance city3 city0) 891)
	(= (distance city3 city1) 598)
	(= (distance city3 city2) 884)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 776)
	(= (distance city4 city0) 899)
	(= (distance city4 city1) 667)
	(= (distance city4 city2) 638)
	(= (distance city4 city3) 776)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city0)
	(at person1 city1)
	(at person2 city3)
	(at person3 city2)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane2 city1)
   changed: (fuel plane2) from 2004 to 11148
   goals met: 0 of 4
2. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 0 to 4600, (fuel plane2) from 11148 to 6548
   goals met: 1 of 4
3. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 4
4. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 4
5. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 4600 to 6368, (fuel plane1) from 1904 to 136
   goals met: 1 of 4
6. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 4
7. (fly plane4 city4 city2)
   deleted: (at plane4 city4)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 6368 to 7644, (fuel plane4) from 1838 to 562
   goals met: 2 of 4
8. (board person1 plane4 city2)
   deleted: (at person1 city2)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 2 of 4
9. (refuel plane4 city2)
   changed: (fuel plane4) from 562 to 4339
   goals met: 2 of 4
10. (fly plane4 city2 city1)
   deleted: (at plane4 city2)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 7644 to 9554, (fuel plane4) from 4339 to 2429
   goals met: 2 of 4
11. (debark person1 plane4 city1)
   deleted: (in person1 plane4)
   added: (at person1 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 3 of 4
12. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 9554 to 13039, (fuel plane2) from 6548 to 3063
   goals met: 2 of 4
13. (debark person3 plane2 city2)
   deleted: (in person3 plane2)
   added: (at person3 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 4
14. (refuel plane2 city2)
   changed: (fuel plane2) from 3063 to 11148
   goals met: 3 of 4
15. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 13039 to 16524, (fuel plane2) from 11148 to 7663
   goals met: 4 of 4
